// 실습9 과제: 학생별 수강과목 및 성적표 대시보드 만들기
// 학생정보, 개설된 '과목정보', 학생들의 '수강신청내역' 각각 존재
// 각 학생별로 어떤 과목을 수강했고, 어떤 성적을 받았는지 보여주는 관리자 대시보드 만들기.
// 성적이 'F'면 'fail', 아니면 'pass'

// * 요구 사항
// 1. 데이터 모델링 : 배열과 객체를 활용하여 샘플데이터로 구성하시오.
//    (1) 아래 각 정보는 필수로 합니다. 
//    - 학생정보 : 학번, 이름, 전공
//    - 과목정보 : 과목코드, 과목명, 교수명
//    - 수강신청내역 : 수강신청내역코드, 학번, 과목코드, 성적
//    (2) 각 정보별 샘플(임의)데이터는 3개 이상씩 하여 배열 또는 객체를 선언 합니다.
// 2. 구현 로직
// 3. 최종 결과물 예시
//    * 웹페이지에 다음과 같은 형식으로 각 유저의 정보가 표시되어야 합니다.
//    * 단  HTML 와 CSS 구성/코드 는 달라도 됩니다.